{
  "name": "Shehan Ford",
  "title": "Senior Associate – F&A | BSc (Hons) Software Engineering ",
  "about": "Results-driven Finance professional holding a BBA (Second Class Upper - 3.58 GPA) and a BSc (Hons) Software Engineering degree (Second-Class Honors). With extensive hands-on experience in financial reporting, ERP systems, and process optimization, I leverage my dual expertise to build and deploy tools that automate complex accounting workflows and drive efficiency. I am currently expanding my technical focus, with a keen interest in applying Data Science and Machine Learning techniques to enhance financial forecasting and risk modeling.",
  "skills": ["Accounting","Financial Reporting","SAP","Wise Cloud","Xero","Python","Flask","Excel","Data Analysis"],
  
  "Education": [
    {
      "period": "2022 – 2025",
      "degree": "BSc (Hons) in Software Engineering",
      "institution": "Cardiff Metropolitan University, UK",
      "details": "Second Class Upper Division"
    },
    {
      "period": "2021 – 2024",
      "degree": "Bachelor of Business Administration (BBA) – Finance",
      "institution": "University of Colombo, Sri Lanka",
      "details": "Second Class Upper Division | GPA: 3.58"
    },
    {
      "period": "2019",
      "degree": "G.C.E. Advanced Level – Commerce Stream",
      "institution": "St. Benedict’s College, Colombo",
      "details": "Results: Accounting – A, Economics – A, Business Studies – A"
    },
    {
      "period": "2016",
      "degree": "G.C.E. Ordinary Level",
      "institution": "St. Benedict’s College, Colombo",
      "details": "Results: 5As and 4Bs"
    }
  ],
  "projects": [
    {
      "id": "proj-1",
      "title": "Restaurant Management System (Java/Web)",
      "short": "A comprehensive web-based system for managing dine-in and delivery reservations with robust multi-level access controls.",
      "detail": "<h4>Technologies Used:</h4> <p>Java, HTML, CSS, JavaScript, MySQL, GitHub</p> <h4>Description:</h4> <p>Developed a full web-based system to manage all aspects of restaurant reservations (dine-in and delivery). Implemented multi-level access controls for admin, customers, and employees, significantly enhancing operational security and user experience.</p> <h4>Results:</h4> <p>Successfully streamlined the reservation process by enabling the system to generate detailed records in both <strong>PDF and CSV formats</strong>, enhancing operational efficiency.</p> <p><strong>Project Link:</strong> https://github.com/Shehanford/restaurant_system</p>"
    },
    {
      "id": "proj-2",
      "title": "Power Plant Monitoring System (Python)",
      "short": "A web-based monitoring system for Resus Energy (solar/hydro) to track, analyze, and report daily energy generation data.",
      "detail": "<h4>Technologies Used:</h4> <p>Python, HTML, CSS, JavaScript, GitHub</p> <h4>Description:</h4> <p>Currently developing a web-based monitoring system for Resus Energy. The system allows plant supervisors to input daily energy generation data, providing managers with real-time analytics on production variations.</p> <h4>Results:</h4> <p>Features like breakdown reporting, data filtering, and downloadable PDF reports are enhancing operational efficiency by providing <strong>real-time insights</strong> into energy generation and maintenance needs across various plants.</p> <p><strong>Project Link:</strong> https://github.com/Shehanford/power-plant-system </p>"
    },
    {
      "id": "proj-3",
      "title": "Plant Disease Management System (ML/Full-Stack)",
      "short": "A scalable, cloud-based platform integrating a Machine Learning model for accurate, real-time plant disease classification.",
      "detail": "<h4>Technologies Used:</h4> <p>Python (Flask), React.js, Firebase, Machine Learning, GitHub</p> <h4>Description:</h4> <p>Built a full-stack web-based platform using React (frontend), Flask (backend), and Firebase (database). The core feature is an integrated machine learning model that classifies plant diseases from image inputs, complete with secure user authentication.</p> <h4>Results:</h4> <p>The system achieved significant improvement in <strong>early disease detection and treatment accuracy</strong>, reducing crop loss through a scalable, multi-user accessible cloud platform.</p> <p><strong>Project Link:</strong> https://github.com/Shehanford/model_CI </p>"
    }
],
  "experience": [
    {
      "role": "Associate – Finance & Accounting (F&A)",
      "org": "WNS Global Services",
      "date": "Mar 2025 – Present",
      "details": "Process and validate financial transactions, use Wise Cloud for real-time financial management, support month-end close, and collaborate cross-functionally to improve controls."
    },
    {
      "role": "Finance Trainee",
      "org": "Resus Energy PLC",
      "date": "Aug 2024 – Feb 2025",
      "details": "Managed payments, used SAP for recording transactions, assisted with reconciliations and month-end processes."
    }
  ],
  "contact": {
    "email": "shehanrford@gmail.com",
    "phone": "+947705246616",
    "location": "Wattala, Sri Lanka",
    "linkedin": "https://www.linkedin.com/in/shehanrford/"
  }
}
